l1117/NRF51822_Datelog/main.c
static bool                                  m_memory_access_in_progress = false;       /**< Flag to keep track of ongoing operations on persistent memory. */

#ifdef BLE_DFU_APP_SUPPORT    
static ble_dfu_t                             m_dfus;                                    /**< Structure used to identify the DFU service. */
#endif // BLE_DFU_APP_SUPPORT    

static uint8_t pstorage_wait_flag = 0;
static pstorage_block_t pstorage_wait_handle = 0;
static pstorage_handle_t       flash_base_handle;
static uint32_t 	flash_block_num;
// YOUR_JOB: Modify these according to requirements (e.g. if other event types are to pass through
//           the scheduler).
#define SCHED_MAX_EVENT_DATA_SIZE       sizeof(app_timer_event_t)                   /**< Maximum size of scheduler events. Note that scheduler BLE stack events do not contain any data, as the events are being pulled from the stack in the event handler. */
#define SCHED_QUEUE_SIZE                10                                          /**< Maximum number of events in the scheduler queue. */

// Persistent storage system event handler
void pstorage_sys_event_handler (uint32_t p_evt);


static void application_timers_stop(void);
static void application_timers_start(void);

#define TIME_PERIOD	 			5       /*5TM time period in seconds*/

////////////////////////////////////////////////
/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze 
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);

}


uint16_t    batt_lvl_in_milli_volts;

#define ADC_REF_VOLTAGE_IN_MILLIVOLTS        1200                                      /**< Reference voltage (in milli volts) used by ADC while doing conversion. */
#define ADC_PRE_SCALING_COMPENSATION         3                                         /**< The ADC is configured to use VDD with 1/3 prescaling as input. And hence the result of conversion is to be multiplied by 3 to get the actual value of the battery voltage.*/
#define DIODE_FWD_VOLT_DROP_MILLIVOLTS       270                                       /**< Typical forward voltage drop of the diode (Part no: SD103ATW-7-F) that is connected in series with the voltage supply. This is the voltage drop when the forward current is 1mA. Source: Data sheet of 'SURFACE MOUNT SCHOTTKY BARRIER DIODE ARRAY' available at www.diodes.com. */
#define ADC_RESULT_IN_MILLI_VOLTS(ADC_VALUE)\
        ((((ADC_VALUE) * ADC_REF_VOLTAGE_IN_MILLIVOLTS) / 255) * ADC_PRE_SCALING_COMPENSATION)
void battery_start(uint32_t AnalogInput)
{
//    uint32_t err_code=0;
//	sd_nvic_SetPriority(ADC_IRQn, NRF_APP_PRIORITY_LOW);  
//	sd_nvic_EnableIRQ(ADC_IRQn);
//	

		if (AnalogInput==4)  AnalogInput=ADC_CONFIG_PSEL_AnalogInput4 ;
		else  AnalogInput=ADC_CONFIG_PSEL_AnalogInput6 ;
    // Configure ADC
    NRF_ADC->INTENSET   = AAR_INTENSET_END_Disabled;   				//ADC  Interrupt disabled. Must be disable.
    NRF_ADC->CONFIG     = (ADC_CONFIG_RES_8bit                        << ADC_CONFIG_RES_Pos)     |
                          (ADC_CONFIG_INPSEL_AnalogInputOneThirdPrescaling << ADC_CONFIG_INPSEL_Pos)  |
                          (ADC_CONFIG_REFSEL_VBG                      << ADC_CONFIG_REFSEL_Pos)  |
                          (AnalogInput                   << ADC_CONFIG_PSEL_Pos)    |
                          (ADC_CONFIG_EXTREFSEL_None                  << ADC_CONFIG_EXTREFSEL_Pos);
    NRF_ADC->ENABLE     = ADC_ENABLE_ENABLE_Enabled;

//			uint32_t p_is_running = 0;

//			sd_clock_hfclk_request();
//			while(! p_is_running) {  							//wait for the hfclk to be available
//				sd_clock_hfclk_is_running((&p_is_running));
//			}               
		NRF_ADC->TASKS_START = 1;							//Start ADC sampling
    NRF_ADC->EVENTS_END  = 0;    // Stop any running conversions.
				uint8_t adc_delay=0;
        while (!NRF_ADC->EVENTS_END && adc_delay<0xff)  adc_delay++;
    NRF_ADC->EVENTS_END  = 0;    // Stop any running conversions.

        NRF_ADC->TASKS_STOP     = 1;
				NRF_ADC->ENABLE     = ADC_ENABLE_ENABLE_Disabled;
        batt_lvl_in_milli_volts = ADC_RESULT_IN_MILLI_VOLTS(NRF_ADC->RESULT); // + DIODE_FWD_VOLT_DROP_MILLIVOLTS;
//		sd_clock_hfclk_release();
}

//void ADC_IRQHandler(void)
//{
//	/* Clear dataready event */
//  NRF_ADC->EVENTS_END = 0;	
//   batt_lvl_in_milli_volts = ADC_RESULT_IN_MILLI_VOLTS(NRF_ADC->RESULT); // + DIODE_FWD_VOLT_DROP_MILLIVOLTS;
//	
//	//Use the STOP task to save current. Workaround for PAN_028 rev1.5 anomaly 1.
//  NRF_ADC->TASKS_STOP = 1;
//	NRF_ADC->ENABLE     = ADC_ENABLE_ENABLE_Disabled;

//	//Release the external crystal
//	sd_clock_hfclk_release();
//}	


/**@brief Function for the Characteristic notification.
 *
 * @details Sends one characteristic value notification to peer if connected to it and the
 *          notification is enabled.
 */
static void char_notify(void)
{
    uint32_t err_code;
    uint16_t len = APP_CFG_CHAR_LEN;
		err_code = NRF_SUCCESS;

    // Send value if connected and notifying.
    if ((m_conn_handle != BLE_CONN_HANDLE_INVALID) && m_is_notifying_enabled)
    {
				ble_gatts_hvx_params_t 		hvx_params;
        memset(&hvx_params, 0, sizeof(hvx_params));
        hvx_params.handle   = m_bas.Vtm_date_time_handles.value_handle;  //   m_char_handles.value_handle;
//        hvx_params.handle   = m_bas.battery_level_handles.value_handle;  //   m_char_handles.value_handle;
        hvx_params.type     = BLE_GATT_HVX_NOTIFICATION;
        hvx_params.offset   = 0;
        hvx_params.p_len    = &len;
//        hvx_params.p_data   = (uint8_t *) flash_load;  //m_char_value;
//				pstorage_handle_t flash_handle;

				while(true){
					hvx_params.p_data   = ((uint8_t *) &flash_page_data[(uint8_t)timer_shifting]);  //m_char_value;
					err_code = sd_ble_gatts_hvx(m_conn_handle, &hvx_params);
					if ((err_code == BLE_ERROR_NO_TX_BUFFERS) ||
							(err_code == NRF_ERROR_INVALID_STATE) ||
							(err_code == BLE_ERROR_GATTS_SYS_ATTR_MISSING)
					)
							{
									break;
							}
					else if ((err_code != NRF_SUCCESS))
							{
									APP_ERROR_HANDLER(err_code);
							}
					else 	if (timer_shifting > 254)
							{
								m_is_notifying_enabled =  false;
								application_timers_start();
								break;
							}
					else {
									timer_shifting += 5;
								}
					}
		}
}
 char char_hex( char bHex){
		bHex&=0x0f;
    if((bHex<10))
        bHex += '0';
    else bHex += 'A'-10;
//    else bHex = 0xff;
    return bHex;
}

