l1117/NRF51822_Datelog/main.c
/**@brief Function for the GAP initialization.
 *
 * @details This function shall be used to setup all the necessary GAP (Generic Access Profile)
 *          parameters of the device. It also sets the permissions.
 *
 */
static void gap_params_init(char *sadvname)
{
    uint32_t                err_code;
		uint8_t 								i;
//    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;
		char adv_name[23] = "CSTNET_" ;
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
		ble_gap_addr_t  	p_addr;
    sd_ble_gap_address_get	(	&p_addr	);
//		sprintf(adv_name, "CSTNET_%4s:%x%x%x%x%x%x",sadvname,p_addr.addr[5],p_addr.addr[4],p_addr.addr[3],p_addr.addr[2],p_addr.addr[1],p_addr.addr[0]);
    for (i=7;sadvname[i-7];i++) adv_name[i]=sadvname[i-7];
		adv_name[i++] = char_hex(p_addr.addr[5]>>4);		adv_name[i++] = char_hex(p_addr.addr[5]);
		adv_name[i++] = char_hex(p_addr.addr[4]>>4);		adv_name[i++] = char_hex(p_addr.addr[4]);
		adv_name[i++] = char_hex(p_addr.addr[3]>>4);		adv_name[i++] = char_hex(p_addr.addr[3]);
		adv_name[i++] = char_hex(p_addr.addr[2]>>4);		adv_name[i++] = char_hex(p_addr.addr[2]);
		adv_name[i++] = char_hex(p_addr.addr[1]>>4);		adv_name[i++] = char_hex(p_addr.addr[1]);
		adv_name[i++] = char_hex(p_addr.addr[0]>>4);		adv_name[i++] = char_hex(p_addr.addr[0]);
		err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)adv_name ,
                                          24);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the connectable advertisement parameters.
 *
 * @details This function initializes the advertisement parameters to values that will put 
 *          the application in connectable mode.
 *
 */
static void connectable_adv_init(void)
{
    // Initialize advertising parameters (used when starting advertising).
    memset(&m_adv_params, 0, sizeof(m_adv_params));
    
    m_adv_params.type        = BLE_GAP_ADV_TYPE_ADV_IND ;
    m_adv_params.p_peer_addr = NULL;                               // Undirected advertisement
    m_adv_params.fp          = BLE_GAP_ADV_FP_ANY;
    m_adv_params.interval    = CONNECTABLE_ADV_INTERVAL;
    m_adv_params.timeout     = CONNECTABLE_ADV_TIMEOUT;
}

/**@brief Function for initializing the Advertisement packet.
 *
 * @details This function initializes the data that is to be placed in an advertisement packet in 
 *          both connectable and non-connectable modes.
 *
 */

#ifdef BLE_DFU_APP_SUPPORT    
static void advertising_stop(void)
{
    uint32_t err_code;

    err_code = sd_ble_gap_adv_stop();
    APP_ERROR_CHECK(err_code);

//    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
//    APP_ERROR_CHECK(err_code);
}


/** @snippet [DFU BLE Reset prepare] */
static void reset_prepare(void)
{
    uint32_t err_code;
    
    if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        // Disconnect from peer.
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        APP_ERROR_CHECK(err_code);
//        err_code = bsp_indication_set(BSP_INDICATE_IDLE);
//        APP_ERROR_CHECK(err_code);
    }
    else
    {
        // If not connected, then the device will be advertising. Hence stop the advertising.
        advertising_stop();
    }

    err_code = ble_conn_params_stop();
    APP_ERROR_CHECK(err_code);
}
/** @snippet [DFU BLE Reset prepare] */
#endif // BLE_DFU_APP_SUPPORT    

static void service_add(void)
{
    uint32_t       			err_code;
//    ble_bas_init_t 			bas_init;
    ble_gatts_char_md_t char_md;
    ble_gatts_attr_md_t cccd_md;
    ble_gatts_attr_t    attr_char_value;
    ble_uuid_t          ble_uuid;
    ble_gatts_attr_md_t attr_md;
//    uint8_t             init_len;

    // Initialize Battery Service.
//    memset(&bas_init, 0, sizeof(bas_init));

    // Here the sec level for the Battery Service can be changed/increased.
//    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.cccd_write_perm);
//    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.read_perm);
//    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&bas_init.battery_level_char_attr_md.write_perm);

//    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_report_read_perm);


    // Add service
    BLE_UUID_BLE_ASSIGN(ble_uuid, BLE_UUID_ALERT_NOTIFICATION_SERVICE);
    err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, &ble_uuid, &m_service_handle);
    APP_ERROR_CHECK(err_code);


    // cccd_md init characteristic
        memset(&cccd_md, 0, sizeof(cccd_md));
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.write_perm);
//        cccd_md.write_perm = bas_init.battery_level_char_attr_md.cccd_write_perm;
        cccd_md.vloc       = BLE_GATTS_VLOC_STACK;

				memset(&char_md, 0, sizeof(char_md));
				char_md.char_props.broadcast = 1;
//				char_md.char_props.read   = 1;
//		    char_md.char_props.write   = 1;
				char_md.char_props.notify = 1;
				char_md.p_char_user_desc  = NULL;
				char_md.p_char_pf         = NULL;
				char_md.p_user_desc_md    = NULL;
				char_md.p_cccd_md         = (char_md.char_props.notify) ? &cccd_md : NULL;
				char_md.p_sccd_md         = (char_md.char_props.broadcast) ? &cccd_md : NULL;

				memset(&attr_md, 0, sizeof(attr_md));
				BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
//				attr_md.read_perm  = bas_init.battery_level_char_attr_md.read_perm;
////				attr_md.write_perm = bas_init.battery_level_char_attr_md.write_perm;
				attr_md.vloc       = BLE_GATTS_VLOC_STACK;
				attr_md.rd_auth    = 0;
				attr_md.wr_auth    = 0;
				attr_md.vlen       = 1;  //0;

				memset(&attr_char_value, 0, sizeof(attr_char_value));

				attr_char_value.p_attr_md = &attr_md;
				attr_char_value.init_len  = sizeof(uint32_t);
				attr_char_value.init_offs = 0;
				attr_char_value.max_len   = 20; //sizeof(uint32_t);
				attr_char_value.p_value   = NULL; 
// char data_time
				BLE_UUID_BLE_ASSIGN(ble_uuid, BLE_UUID_DATE_TIME_CHAR);
				attr_char_value.p_uuid    = &ble_uuid;
				err_code = sd_ble_gatts_characteristic_add(m_bas.service_handle, &char_md,
																									 &attr_char_value,
																									 &m_bas.Vtm_date_time_handles);
				char_md.char_props.broadcast = 0;
				char_md.char_props.read   = 1;
				char_md.char_props.write   = 0;
				char_md.char_props.notify = 0;
				char_md.p_cccd_md         = (char_md.char_props.notify) ? &cccd_md : NULL;
				char_md.p_sccd_md         = (char_md.char_props.broadcast) ? &cccd_md : NULL;

				attr_char_value.max_len   = sizeof(uint32_t);
// char battery_level
				BLE_UUID_BLE_ASSIGN(ble_uuid, BLE_UUID_BATTERY_LEVEL_CHAR);
				attr_char_value.p_uuid    = &ble_uuid;
				err_code = sd_ble_gatts_characteristic_add(m_bas.service_handle, &char_md,
																									 &attr_char_value,
																									 &m_bas.battery_level_handles);

				BLE_UUID_BLE_ASSIGN(ble_uuid, BLE_UUID_TEMPERATURE_MEASUREMENT_CHAR);
				attr_char_value.p_uuid    = &ble_uuid;
				err_code = sd_ble_gatts_characteristic_add(m_bas.service_handle, &char_md,
																									 &attr_char_value,
																									 &m_bas.Vtm_temp_level_handles);

