l1117/NRF51822_Datelog/main.c
				BLE_UUID_BLE_ASSIGN(ble_uuid, BLE_UUID_HID_INFORMATION_CHAR);
				attr_char_value.p_uuid    = &ble_uuid;
				err_code = sd_ble_gatts_characteristic_add(m_bas.service_handle, &char_md,
																									 &attr_char_value,
																									 &m_bas.Vtm_humi_level_handles);

				BLE_UUID_BLE_ASSIGN(ble_uuid, BLE_UUID_TEMPERATURE_TYPE_CHAR);
				attr_char_value.p_uuid    = &ble_uuid;
				err_code = sd_ble_gatts_characteristic_add(m_bas.service_handle, &char_md,
																									 &attr_char_value,
																									 &m_bas.Nrf_temp_level_handles);


				BLE_UUID_BLE_ASSIGN(ble_uuid, BLE_UUID_REPORT_CHAR);
				attr_char_value.p_uuid    = &ble_uuid;
				err_code = sd_ble_gatts_characteristic_add(m_bas.service_handle, &char_md,
																									 &attr_char_value,
																									 &m_bas.Nrf_name_handles);

#ifdef BLE_DFU_APP_SUPPORT    
    /** @snippet [DFU BLE Service initialization] */
    ble_dfu_init_t   dfus_init;

    // Initialize the Device Firmware Update Service.
    memset(&dfus_init, 0, sizeof(dfus_init));

    dfus_init.evt_handler    = dfu_app_on_dfu_evt;
    dfus_init.error_handler  = NULL; //service_error_handler - Not used as only the switch from app to DFU mode is required and not full dfu service.
    dfus_init.evt_handler    = dfu_app_on_dfu_evt;
    dfus_init.revision       = DFU_REVISION;

    err_code = ble_dfu_init(&m_dfus, &dfus_init);
    APP_ERROR_CHECK(err_code);
    
    dfu_app_reset_prepare_set(reset_prepare);
    /** @snippet [DFU BLE Service initialization] */
#endif // BLE_DFU_APP_SUPPORT    
}


/**@brief Function for handling the Notification timeout.
 *
 * @details This function will be called when the notification timer expires. This will stop the
 *          timer for connection interval and disconnect from the peer.
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the timeout handler.
 */
static void notif_timeout_handler(void * p_context)
{
    uint32_t err_code;
    
    UNUSED_PARAMETER(p_context);

    // Stop all notifications (by stopping the timer for connection interval that triggers 
    // notifications and disconnecting from peer).
    err_code = app_timer_stop(m_conn_int_timer_id); 
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the Connection interval timeout.
 *
 * @details This function will be called when the connection interval timer expires. This will
 *          trigger another characteristic notification to the peer.
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the timeout handler.
 */
static void connection_interval_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);

    // Into next connection interval. Send one notification.
				char_notify();
}
static void example_cb_handler(pstorage_handle_t  * handle,
															 uint8_t              op_code,
                               uint32_t             result,
                               uint8_t            * p_data,
                               uint32_t             data_len)
{
		if(handle->block_id == pstorage_wait_handle) { pstorage_wait_flag = 0; }  //If we are waiting for this callback, clear the wait flag.
}

static void s5tm_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
		uint8_t data_id = 0, data_pos = false;
    static uint32_t data_saved ;  //must be STATIC for pstorage_store()
		uint32_t err_code=0;
		uint8_t timer_flash_id = ((uint8_t)( timer_counter/TIME_PERIOD));
//		uint16_t len = 4;
//		timer_counter+=TIME_PERIOD;
				battery_start(4);	 //For 3.3V boster
//					battery_start(6);  //For 3.7V Li Battery 
	
//				ble_bas_battery_level_update(&m_bas,batt_lvl_in_milli_volts/100);  //For display 3.0V*100 on IOS
				
				nrf_gpio_pin_set (13);												//Open power and UART for 5TM 
				NRF_UART0->POWER = (UART_POWER_POWER_Enabled << UART_POWER_POWER_Pos);
				simple_uart_config(NULL, 10, NULL, 12, false);
				uint8_t cr; //rx_count=10;
				Vtm_humi=0,Vtm_unknow=0,Vtm_temp=0;
				for (uint8_t i=0;i<50;i++){										//Get date from 5tm 
//						m_addl_adv_manuf_data[rx_count++]=cr;  //simple_uart_put(cr);

					if (simple_uart_get_with_timeout(4, &cr)) {
							if (cr == 0x20) data_pos = true;    //5TM data start postion.
							if ((cr>>4) == 3 ) { 
								switch (data_id){
									case 1: {
										Vtm_humi = Vtm_humi<<4;
										Vtm_humi |= (cr & 0x0F) ;
										break;
										}
									case 2:  {
										Vtm_unknow = Vtm_unknow<<4;
										Vtm_unknow |= (cr & 0x0F) ;
										break;
										}
									case 3: {
										Vtm_temp = Vtm_temp<<4;
										Vtm_temp |= (cr & 0x0F) ;
										break;
										}
									default: break;
								}
							}
						else if(data_pos) data_id++;
					}
		}	
				NRF_UART0->POWER = (UART_POWER_POWER_Disabled << UART_POWER_POWER_Pos);
				nrf_gpio_pin_clear (13);
				sd_temp_get(&nrf_temp);  													//Get Cpu tempreature

//				data_saved = (Vtm_humi << 16) + Vtm_temp ;
				data_saved = (timer_counter<<16)+ batt_lvl_in_milli_volts ; //test flash write

						pstorage_handle_t flash_handle;
						pstorage_block_identifier_get(&flash_base_handle,((((timer_counter/TIME_PERIOD)>>8))%PSTORAGE_MAX_APPLICATIONS), &flash_handle);
						if (flash_handle.block_id != flash_handle_last.block_id || flash_handle.module_id != flash_handle_last.module_id) {
								flash_handle_last = flash_handle;
								err_code = pstorage_clear(&flash_handle,1024);
							}
						err_code = pstorage_store(&flash_handle, (uint8_t * )&data_saved, 4, timer_flash_id*4);

			 *( (uint32_t *)     m_addl_adv_manuf_data)  = timer_counter ;
			 *( (uint16_t *) (m_addl_adv_manuf_data+4))  = Vtm_temp ;
			 *( (uint16_t *) (m_addl_adv_manuf_data+6))  = Vtm_unknow ;
			 *( (uint16_t *) (m_addl_adv_manuf_data+8))  = Vtm_humi;
			 *( (uint16_t *) (m_addl_adv_manuf_data+10)) = batt_lvl_in_milli_volts ;
			 *( (uint32_t *) (m_addl_adv_manuf_data+12)) = nrf_temp ;
				err_code = ble_advdata_set(&advdata, NULL);
				APP_ERROR_CHECK(err_code);
}

static void timecounter_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
		if (++timer_counter%TIME_PERIOD){  
				*( (uint32_t *) m_addl_adv_manuf_data) = timer_counter ;
			uint32_t	err_code = ble_advdata_set(&advdata, NULL);
//				APP_ERROR_CHECK(err_code);
			}
		else s5tm_timeout_handler(NULL);
}




